{"keras_version": "2.1.5", "class_name": "Sequential", "config": [{"class_name": "TimeDistributed", "config": {"trainable": true, "layer": {"class_name": "Dense", "config": {"bias_regularizer": null, "trainable": true, "units": 32, "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_regularizer": null, "name": "dense_1", "bias_constraint": null, "activation": "linear"}}, "batch_input_shape": [null, null, 10], "dtype": "float32", "name": "time_distributed_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "seed": null, "noise_shape": null, "name": "dropout_1", "rate": 0.1}}, {"class_name": "TimeDistributed", "config": {"trainable": true, "layer": {"class_name": "Dense", "config": {"bias_regularizer": null, "trainable": true, "units": 32, "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_regularizer": null, "name": "dense_2", "bias_constraint": null, "activation": "linear"}}, "name": "time_distributed_2"}}, {"class_name": "Dropout", "config": {"trainable": true, "seed": null, "noise_shape": null, "name": "dropout_2", "rate": 0.1}}, {"class_name": "LSTM", "config": {"return_state": false, "trainable": true, "stateful": false, "bias_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_activation": "hard_sigmoid", "return_sequences": false, "unit_forget_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "use_bias": true, "unroll": false, "recurrent_constraint": null, "name": "lstm_1", "activity_regularizer": null, "units": 65, "kernel_constraint": null, "go_backwards": false, "recurrent_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dropout": 0.0, "implementation": 1, "kernel_regularizer": null, "recurrent_dropout": 0.0, "bias_constraint": null, "activation": "tanh"}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "trainable": true, "units": 13, "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_regularizer": null, "name": "dense_3", "bias_constraint": null, "activation": "softmax"}}], "backend": "tensorflow"}