{"class_name": "Sequential", "config": [{"class_name": "TimeDistributed", "config": {"trainable": true, "dtype": "float32", "batch_input_shape": [null, null, 10], "name": "time_distributed_1", "layer": {"class_name": "Dense", "config": {"bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "kernel_constraint": null, "units": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "activation": "linear", "trainable": true}}}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.1, "seed": null, "name": "dropout_1", "noise_shape": null}}, {"class_name": "TimeDistributed", "config": {"trainable": true, "name": "time_distributed_2", "layer": {"class_name": "Dense", "config": {"bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "kernel_constraint": null, "units": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_2", "activation": "linear", "trainable": true}}}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.1, "seed": null, "name": "dropout_2", "noise_shape": null}}, {"class_name": "LSTM", "config": {"kernel_regularizer": null, "dropout": 0.0, "bias_regularizer": null, "go_backwards": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "kernel_constraint": null, "units": 75, "return_sequences": false, "unit_forget_bias": true, "name": "lstm_1", "recurrent_constraint": null, "recurrent_dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "implementation": 1, "recurrent_activation": "hard_sigmoid", "stateful": false, "bias_constraint": null, "activity_regularizer": null, "trainable": true, "recurrent_regularizer": null, "unroll": false, "return_state": false, "activation": "tanh", "use_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}}}, {"class_name": "Dense", "config": {"bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "kernel_constraint": null, "units": 15, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_3", "activation": "softmax", "trainable": true}}], "backend": "tensorflow", "keras_version": "2.1.5"}