{"config": [{"class_name": "TimeDistributed", "config": {"batch_input_shape": [null, null, 10], "trainable": true, "layer": {"class_name": "Dense", "config": {"activity_regularizer": null, "activation": "linear", "name": "dense_1", "bias_regularizer": null, "units": 32, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "trainable": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_regularizer": null}}, "name": "time_distributed_1", "dtype": "float32"}}, {"class_name": "Dropout", "config": {"trainable": true, "seed": null, "rate": 0.1, "noise_shape": null, "name": "dropout_1"}}, {"class_name": "TimeDistributed", "config": {"trainable": true, "layer": {"class_name": "Dense", "config": {"activity_regularizer": null, "activation": "linear", "name": "dense_2", "bias_regularizer": null, "units": 32, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "trainable": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_regularizer": null}}, "name": "time_distributed_2"}}, {"class_name": "Dropout", "config": {"trainable": true, "seed": null, "rate": 0.1, "noise_shape": null, "name": "dropout_2"}}, {"class_name": "LSTM", "config": {"activation": "tanh", "units": 10, "implementation": 1, "recurrent_dropout": 0.0, "dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "trainable": true, "return_state": false, "go_backwards": false, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "name": "lstm_1", "stateful": false, "activity_regularizer": null, "return_sequences": false, "kernel_regularizer": null, "bias_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_constraint": null, "recurrent_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "unroll": false, "use_bias": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "activation": "softmax", "name": "dense_3", "bias_regularizer": null, "units": 2, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "trainable": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_regularizer": null}}], "class_name": "Sequential", "keras_version": "2.1.5", "backend": "tensorflow"}