{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.1.5", "config": [{"class_name": "TimeDistributed", "config": {"dtype": "float32", "name": "time_distributed_1", "batch_input_shape": [null, null, 10], "trainable": true, "layer": {"class_name": "Dense", "config": {"activation": "linear", "name": "dense_1", "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "units": 32, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "trainable": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}}}, {"class_name": "Dropout", "config": {"noise_shape": null, "name": "dropout_1", "trainable": true, "seed": null, "rate": 0.1}}, {"class_name": "TimeDistributed", "config": {"name": "time_distributed_2", "trainable": true, "layer": {"class_name": "Dense", "config": {"activation": "linear", "name": "dense_2", "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "units": 32, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "trainable": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}}}, {"class_name": "Dropout", "config": {"noise_shape": null, "name": "dropout_2", "trainable": true, "seed": null, "rate": 0.1}}, {"class_name": "LSTM", "config": {"recurrent_dropout": 0.0, "recurrent_regularizer": null, "recurrent_constraint": null, "kernel_regularizer": null, "unit_forget_bias": true, "unroll": false, "recurrent_activation": "hard_sigmoid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "activity_regularizer": null, "activation": "tanh", "name": "lstm_1", "return_sequences": false, "return_state": false, "kernel_constraint": null, "bias_regularizer": null, "trainable": true, "units": 15, "use_bias": true, "stateful": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "implementation": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dropout": 0.0, "bias_constraint": null, "go_backwards": false}}, {"class_name": "Dense", "config": {"activation": "softmax", "name": "dense_3", "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "units": 3, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "trainable": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}]}