{"class_name": "Sequential", "keras_version": "2.1.5", "backend": "tensorflow", "config": [{"class_name": "TimeDistributed", "config": {"trainable": true, "name": "time_distributed_1", "dtype": "float32", "layer": {"class_name": "Dense", "config": {"bias_constraint": null, "kernel_constraint": null, "use_bias": true, "name": "dense_1", "trainable": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "units": 32, "kernel_regularizer": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}}}, "batch_input_shape": [null, null, 10]}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "noise_shape": null, "rate": 0.1, "seed": null}}, {"class_name": "TimeDistributed", "config": {"trainable": true, "name": "time_distributed_2", "layer": {"class_name": "Dense", "config": {"bias_constraint": null, "kernel_constraint": null, "use_bias": true, "name": "dense_2", "trainable": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "units": 32, "kernel_regularizer": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}}}}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "noise_shape": null, "rate": 0.1, "seed": null}}, {"class_name": "LSTM", "config": {"kernel_constraint": null, "use_bias": true, "recurrent_dropout": 0.0, "recurrent_regularizer": null, "activity_regularizer": null, "dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 35, "recurrent_activation": "hard_sigmoid", "kernel_regularizer": null, "go_backwards": false, "bias_constraint": null, "recurrent_constraint": null, "implementation": 1, "unit_forget_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "trainable": true, "unroll": false, "bias_regularizer": null, "name": "lstm_1", "stateful": false, "return_state": false, "return_sequences": false, "activation": "tanh", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}}}, {"class_name": "Dense", "config": {"bias_constraint": null, "kernel_constraint": null, "use_bias": true, "name": "dense_3", "trainable": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "units": 7, "kernel_regularizer": null, "activation": "softmax", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}}}]}